---
kind: type
id: T:Autodesk.Revit.DB.ExternalDefinitions
source: html/118c8988-bc1e-e46e-1a47-e2f44635b303.htm
---
# Autodesk.Revit.DB.ExternalDefinitions

Supports the creation of new shared parameters definitions.

## Syntax (C#)
```csharp
public class ExternalDefinitions : Definitions
```